# ColumnZeroHeightError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnFailures..::..ColumnZeroHeightError Property
BuiltInFailures..::..ColumnFailures Class See Also
---
The column can't have zero height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnZeroHeightError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnZeroHeightError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnZeroHeightError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnFailures Class
Autodesk.Revit.DB Namespace